Итоговый_проект_2/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Итоговый_проект_2/src/Documents/ПоступлениеТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)
	// Рассчитывать сумму по количеству и вызывать ПриИзмененииСуммы()  
	РассчитатьСуммаСтроки (ИзмененнаяСтрока); 
	ПриИзмененииСуммы(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)
	// Рассчитывать сумму по цене и вызывать ПриИзмененииСуммы() 
    РассчитатьСуммаСтроки (ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока) 
	
	Если ПустаяСтрока(ИзмененнаяСтрока.Количество) или ПустаяСтрока(ИзмененнаяСтрока.Цена) Тогда
		Возврат;
	Иначе 
		ИзмененнаяСтрока.Цена = ИзмененнаяСтрока.Сумма / ИзмененнаяСтрока.Количество;
	КонецЕсли;
	// Рассчитывать сумму НДС по сумме вызовом НДСКлиентСервер.СуммаНДСПоСтавке() 
	РассчитатьСуммаНДС (ИзмененнаяСтрока);    
	

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)
	// Рассчитывать сумму НДС по ставке вызовом НДСКлиентСервер.СуммаНДСПоСтавке() 
    РассчитатьСуммаНДС (ИзмененнаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент)
	// Переопределить обработчики событий ПриИзменении полей ввода для количества, 
	//цены, суммы и ставки НДС, и вызывать из них процедуры ПриИзменении<...>, 
	//передавая в качестве параметра ТекущиеДанные таблицы

    ТекДанные = Элементы.ТоварыИУслуги.ТекущиеДанные;
	  
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииКоличества(ТекДанные);
    
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент)
	// Переопределить обработчики событий ПриИзменении полей ввода для количества, 
	//цены, суммы и ставки НДС, и вызывать из них процедуры ПриИзменении<...>, 
	//передавая в качестве параметра ТекущиеДанные таблицы

	ТекДанные = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПриИзмененииЦены(ТекДанные);  
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент)  
	// Переопределить обработчики событий ПриИзменении полей ввода для количества, 
	//цены, суммы и ставки НДС, и вызывать из них процедуры ПриИзменении<...>, 
	//передавая в качестве параметра ТекущиеДанные таблицы

	ТекДанные = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	ПриИзмененииСуммы(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)
	// Переопределить обработчики событий ПриИзменении полей ввода для количества, 
	//цены, суммы и ставки НДС, и вызывать из них процедуры ПриИзменении<...>, 
	//передавая в качестве параметра ТекущиеДанные таблицы

	ТекДанные = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	ПриИзмененииСтавкиНДС(ТекДанные);

КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммаСтроки (ИзмененнаяСтрока)
	//получим значения в колоках текущей строки - свойство табличной части ТекущиеДанные
	//Получим коллекцию. в которой есть все данные по строке
       
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Количество * ИзмененнаяСтрока.Цена;
КонецПроцедуры  

&НаКлиенте
Процедура РассчитатьСуммаНДС (ИзмененнаяСтрока)
	//получим значения в колоках текущей строки - свойство табличной части ТекущиеДанные
	//Получим коллекцию. в которой есть все данные по строке
	Если ПустаяСтрока(ИзмененнаяСтрока.СтавкаНДС) Тогда
		Возврат;
	Иначе ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	КонецЕсли;
	
КонецПроцедуры
